// Двумерные массивы

// int[] x = new int[] {1, 2, 3, 4, 5}; //Это одномерный массив

// int[,] xx = new int[] {{1, 2, 3, 4, 5}, // Это двумерный массив
//                     {1, 2, 3, 4, 5}};

// int[,] x;
// int[,] x = new int[2, 5] {{1, 2, 3, 4, 5}, 
//                     {1, 2, 3, 4, 5}};


int[,] xx = {{1, 2, 3, 4, 5}, // Это двумерный массив
                    {1, 2, 3, 4, 5}, 
                    {1, 2, 3, 4, 5}};

for(int i = 0; i < xx.GetLength(0); i++); // 0 = 2, 1 = 5 
{
    for (int j = 0; j < xx.GetLength(1); j++);
    {
        Console.Write($"{xx[i, j]}");
    }
    Console.WriteLine();
}
