// Задача 61: Вывести первые N строк треугольника Паскаля. Сделать вывод в виде равнобедренного треугольника

int a = 1;
int b = 1;
int MaxCount = Convert.ToDouble(Console.ReadLine());
int treangle = Math.Pow((a+b), count);

for (int count = 1; count < MaxCount; count++)
{
Console.WriteLine(treangle);
}

